/**
*********************************************************************************************************
*                                        multi_switch_control
*                                      (c) Copyright 2021-2031
*                                         All Rights Reserved
*
* @File    : 
* @By      : liwei
* @Version : V0.01
* 
*********************************************************************************************************
**/

/*
*********************************************************************************************************
Includes 
*********************************************************************************************************
*/
//#include "user_type.h"
//#include "button_driver.h"
///*
//*********************************************************************************************************
//Define
//*********************************************************************************************************
//*/
//#define KEN_NUM 8
//#define MAX_NUM 100
//#define OFF_NUM 5
//#define DELAY_NUM 2
///*
//*********************************************************************************************************
//Typedef
//*********************************************************************************************************
//*/
//typedef struct key_frame_def
//{
//	u8 flag;		
//	u8 num;
//	u8 time;
//	u16 on;
//	u16 off;
//}key_frame_t;
///*
//*********************************************************************************************************
//Variables
//*********************************************************************************************************
//*/
///*声明BSP层接口*/
//extern interface_template_t button_bsp_internface;
///*当前接口操作指针*/
//static interface_template_t* current_operation = &button_bsp_internface;
//key_frame_t key_manage[10];
///*
//*********************************************************************************************************
//Function 
//*********************************************************************************************************
//*/
//static u8 read(data_stream_t* stream_in, u8* parameter);
//static u8 write(data_stream_t* stream_in, u8* parameter);
//static u8 initialization(data_stream_t* stream_in, u8* parameter);
//static u8 interrput(data_stream_t* stream_in, u8* parameter);
//static u8 run(data_stream_t* stream_in, u8* parameter);

//void button_scanf(data_stream_t* stream_in, u8* parameter);
//static u8 read_all(u8* buff);
//static u8 read_single(u8* buff);
///**
//*********************************************************************************************************
//* @名称	: 
//* @描述	: 
//* @参数	: 
//* @返回	: 
//*********************************************************************************************************
//**/
//interface_template_t button_driver_internface=
//{
//	.read=&read,
//	.write=&write,
//	.initialization=&initialization,
//	.interrput=&interrput,
//	.run=&run,
//};
///**
//*********************************************************************************************************
//* @名称	: 
//* @描述	: 
//* @参数	: 
//* @返回	: 
//*********************************************************************************************************
//**/
//static u8 read(data_stream_t* stream_in, u8* parameter)
//{
//	#define READ_NUM 2
//	typedef u8 (*callback_t)(u8* buff);
//	const callback_t callbacks[READ_NUM] = 
//	{
//		read_all,
//		read_single,
//	};
//	if(stream_in->cmd < READ_NUM)
//	{
//		(callbacks[stream_in->cmd])(stream_in->buff);	
//		return 1;
//	}
//	else
//	return 0;	

//}
///**
//*********************************************************************************************************
//* @名称	: 
//* @描述	: 
//* @参数	: 
//* @返回	: 
//*********************************************************************************************************
//**/
//static u8 read_all(u8* buff)
//{
//	u8 i,j=1;
//	
//	for(i = 0;i < KEN_NUM;i++)
//	{
//		if((key_manage[i].flag == 0)&&(key_manage[i].num > 0))
//		{
//			buff[j++]=i;
//			buff[j++]=key_manage[i].num;
//			/*清除按键次数*/
//			key_manage[i].num=0;
//		}
//	}
//	return 0;
//}
///**
//*********************************************************************************************************
//* @名称	: 
//* @描述	: 
//* @参数	: 
//* @返回	: 
//*********************************************************************************************************
//**/
//static u8 read_single(u8* buff)
//{
//	u8 i;
//	for(i = 0;i < KEN_NUM;i++)
//	{
//		if((key_manage[i].flag == 0)&&(key_manage[i].num > 0))
//		{
//			buff[0]=i;
//			buff[1]=key_manage[i].num;
//			/*清除按键次数*/
//			key_manage[i].num=0;
//			break;
//		}
//	}
//	return 0;
//}
///**
//*********************************************************************************************************
//* @名称	: 
//* @描述	: 
//* @参数	: 
//* @返回	: 
//*********************************************************************************************************
//**/
//static u8 write(data_stream_t* stream_in, u8* parameter)
//{
//	return 0;
//}
///**
//*********************************************************************************************************
//* @名称	: 
//* @描述	: 
//* @参数	: 
//* @返回	: 
//*********************************************************************************************************
//**/
//static u8 initialization(data_stream_t* stream_in, u8* parameter)
//{
//	
//	current_operation->initialization(stream_in, parameter );
//	return 0;
//}
///**
//*********************************************************************************************************
//* @名称	: 
//* @描述	: 
//* @参数	: 
//* @返回	: 
//*********************************************************************************************************
//**/
//static u8 interrput(data_stream_t* stream_in, u8* parameter)
//{
//	return 0;
//}
///**
//*********************************************************************************************************
//* @名称	: 
//* @描述	: 
//* @参数	: 
//* @返回	: 
//*********************************************************************************************************
//**/
//static u8 run(data_stream_t* stream_in, u8* parameter)
//{
//	button_scanf(stream_in, parameter);
//	return 0;
//}
///**
//*********************************************************************************************************
//* @名称	: 
//* @描述	: 
//* @参数	: 
//* @返回	: 
//*********************************************************************************************************
//**/
//void button_scanf(data_stream_t* stream_in, u8* parameter)
//{
//	u8 ram_i;
//	/*按键扫描*/
//	for(ram_i=0;ram_i<KEN_NUM;ram_i++)
//	{
//		stream_in->cmd=ram_i;
//		if( current_operation->read(stream_in , parameter) )
//		{
//			/*没有按  常判断*/
//			if(key_manage[ram_i].off<MAX_NUM)
//			{
//				if(key_manage[ram_i].flag == 1)
//					key_manage[ram_i].off++;
//				else
//					key_manage[ram_i].off = 0;
//			}
//			 /*按键松开时间超过最大值 进入送按键判断*/
//			if(key_manage[ram_i].off>OFF_NUM)
//			{
//				/*FLAG=1 返回按键值和按次数*/
//				if(key_manage[ram_i].flag == 1)
//				{
//					key_manage[ram_i].flag=0;
//					key_manage[ram_i].on=0;
//					key_manage[ram_i].off=0;
//				
//				}
//			}
//			/*按键松开消抖处理*/
//			if(key_manage[ram_i].off>DELAY_NUM)
//			{
//				/*根据ON计数值  设置NUM数据 判断长按*/		
//				if(key_manage[ram_i].on>0)
//				{
//					/*长按到时间后发送数据*/
//					if(key_manage[ram_i].on==MAX_NUM)
//					{
//						key_manage[ram_i].num=0x0c;
//					}
//					else
//					{	
//						key_manage[ram_i].num++;
//						if(key_manage[ram_i].num>5)
//							key_manage[ram_i].num=5;
//					}				
//					key_manage[ram_i].on=0;
//					
//				}
//			}		
//		}
//		else
//		{
//			/*按下后自加计数*/
//			if(key_manage[ram_i].on<MAX_NUM)
//				key_manage[ram_i].on++;
//			/*按下延时后清数据*/
//			if(key_manage[ram_i].on>DELAY_NUM)
//			{
//			     /*按键按下后 清OFF计数 设置FLAG*/
//				if(key_manage[ram_i].flag!=1)
//				{
//					key_manage[ram_i].flag=1;
//					key_manage[ram_i].off=0;			
//				}
//								
//			}		
//		}
//	}
//}
/***********************************************END*****************************************************/

